Revit 2024 API
RailingType.SecondaryHandrailType Property
 The type of the secondary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId SecondaryHandrailType { get; set; }
Visual Basic
Public Property SecondaryHandrailType As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ SecondaryHandrailType {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The handRailTypeId is not a valid hand rail type.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace